content/reading-note/淘宝技术这十年.org
# -*- coding:utf-8; -*-
#+title: 《淘宝技术这十年》读书笔记
#+author: 刘尚亮
#+email: phenix3443@gmail.com
#+startup:overview

* 第 0 章
  + DNS 如何将不同的访问分配到不同的入口？
  + 大量文件的内容分发网络（CDN）
  + 大量文件的分布式文件系统（TFS）
  + 淘宝的主搜索系统，根据搜索关键词判断购物意图，展现不同结果。
  + 交易快照的保存，Tair
  + 访问日志的实时传输（TimeTunnel）
  + 数据仓库，极限存储，数据挖掘和分析。


* 第 1 章
  + “买一个”是创业初期最快的方式。
  + ebay 收购易趣后没有注重用户体验，丧失用户。
  + 快速响应用户需求。

* 第 2 章
  + 创业初期顶尖人才的重要性：快速解决各种疑难问题。
  + 好的架构和功能都是进化来的。
  + 支付手段和交流方式的创新。

* 第 3 章
  + 技术选型：选择最成熟的，参考竞争对手的选择。
  + 技术实施：用最好人解决最复杂的问题。
  + 技术改造：分模块渐进式改造。
  + 围绕性能，容量，成本进化。

* 第 4 章
  + TFS，Tair，isearch

* 第5章
  + 分布式系统要求底层具有超大规模的容量和非常高的可用性，需要中间件提供系统间的通信和异步消息通知。
  + HSF，高性能服务框架，解决系统间的通信。这是一个分布式的标准service方式的RPC，service方式基于OSGI方式，通讯层采用TCP/IP方式。（对比grpc）
  + Notify，解决异步通信问题。
  + Tbsession，解决用户登录状态问题。
  + TDDL，分布式数据访问层，实现：消息路由，数据的多向非对称复制（类似读写分离），数据存储的自由扩展（异构数据库）。
  + 开放平台，SOA，OAuth2，

* 第6 章
  + 有想法没用，要有产品出来，还要能迅速推向市场。

* 第7 章
  + 正明：找到自己感兴趣的，花时间投进去，通过实践后的指示积累比只看书有用的多。
  + 正祥：
	+ OceanBase
	+ 数据库本质上是一个单机系统，分布式是一个解决方案（不懂！）
	+ 把做事，做成事当作主要目标，心态决定成就。
  + 毕玄：
	+ 最重要的是看对公司做出了多少贡献。
	+ 跳出自己的工作范围，考虑公司将来会面临什么问题，最好是能解决这些问题。

  + 放翁：
	+ 坚持把一个产品做精，做深，最后具有一定的技术发展和影响力。
	+ P7要求人员对一个小的产品或团队有方向性的指导。
	+ P8 要求在一个大部门或公司级的产品上有方向性的指导。
	+ P9要求除了考虑自身产品外，还要求在公司的角度考虑自身的产品对公司的发展有什么帮助。
