reading-note/淘宝技术这十年.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>《淘宝技术这十年》读书笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">《淘宝技术这十年》读书笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc1f95e5">1. 第 0 章</a></li>
<li><a href="#orge636200">2. 第 1 章</a></li>
<li><a href="#orga360dd1">3. 第 2 章</a></li>
<li><a href="#orgf364782">4. 第 3 章</a></li>
<li><a href="#org91fa81e">5. 第 4 章</a></li>
<li><a href="#orgaf59501">6. 第5章</a></li>
<li><a href="#orgee9a0c0">7. 第6 章</a></li>
<li><a href="#orgd90f27b">8. 第7 章</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc1f95e5" class="outline-2">
<h2 id="orgc1f95e5"><span class="section-number-2">1</span> 第 0 章</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>DNS 如何将不同的访问分配到不同的入口？</li>
<li>大量文件的内容分发网络（CDN）</li>
<li>大量文件的分布式文件系统（TFS）</li>
<li>淘宝的主搜索系统，根据搜索关键词判断购物意图，展现不同结果。</li>
<li>交易快照的保存，Tair</li>
<li>访问日志的实时传输（TimeTunnel）</li>
<li>数据仓库，极限存储，数据挖掘和分析。</li>
</ul>
</div>
</div>


<div id="outline-container-orge636200" class="outline-2">
<h2 id="orge636200"><span class="section-number-2">2</span> 第 1 章</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>“买一个”是创业初期最快的方式。</li>
<li>ebay 收购易趣后没有注重用户体验，丧失用户。</li>
<li>快速响应用户需求。</li>
</ul>
</div>
</div>

<div id="outline-container-orga360dd1" class="outline-2">
<h2 id="orga360dd1"><span class="section-number-2">3</span> 第 2 章</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>创业初期顶尖人才的重要性：快速解决各种疑难问题。</li>
<li>好的架构和功能都是进化来的。</li>
<li>支付手段和交流方式的创新。</li>
</ul>
</div>
</div>

<div id="outline-container-orgf364782" class="outline-2">
<h2 id="orgf364782"><span class="section-number-2">4</span> 第 3 章</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>技术选型：选择最成熟的，参考竞争对手的选择。</li>
<li>技术实施：用最好人解决最复杂的问题。</li>
<li>技术改造：分模块渐进式改造。</li>
<li>围绕性能，容量，成本进化。</li>
</ul>
</div>
</div>

<div id="outline-container-org91fa81e" class="outline-2">
<h2 id="org91fa81e"><span class="section-number-2">5</span> 第 4 章</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>TFS，Tair，isearch</li>
</ul>
</div>
</div>

<div id="outline-container-orgaf59501" class="outline-2">
<h2 id="orgaf59501"><span class="section-number-2">6</span> 第5章</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>分布式系统要求底层具有超大规模的容量和非常高的可用性，需要中间件提供系统间的通信和异步消息通知。</li>
<li>HSF，高性能服务框架，解决系统间的通信。这是一个分布式的标准service方式的RPC，service方式基于OSGI方式，通讯层采用TCP/IP方式。（对比grpc）</li>
<li>Notify，解决异步通信问题。</li>
<li>Tbsession，解决用户登录状态问题。</li>
<li>TDDL，分布式数据访问层，实现：消息路由，数据的多向非对称复制（类似读写分离），数据存储的自由扩展（异构数据库）。</li>
<li>开放平台，SOA，OAuth2，</li>
</ul>
</div>
</div>

<div id="outline-container-orgee9a0c0" class="outline-2">
<h2 id="orgee9a0c0"><span class="section-number-2">7</span> 第6 章</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>有想法没用，要有产品出来，还要能迅速推向市场。</li>
</ul>
</div>
</div>

<div id="outline-container-orgd90f27b" class="outline-2">
<h2 id="orgd90f27b"><span class="section-number-2">8</span> 第7 章</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>正明：找到自己感兴趣的，花时间投进去，通过实践后的指示积累比只看书有用的多。</li>
<li>正祥：
<ul class="org-ul">
<li>OceanBase</li>
<li>数据库本质上是一个单机系统，分布式是一个解决方案（不懂！）</li>
<li>把做事，做成事当作主要目标，心态决定成就。</li>
</ul></li>
<li>毕玄：
<ul class="org-ul">
<li>最重要的是看对公司做出了多少贡献。</li>
<li>跳出自己的工作范围，考虑公司将来会面临什么问题，最好是能解决这些问题。</li>
</ul></li>

<li>放翁：
<ul class="org-ul">
<li>坚持把一个产品做精，做深，最后具有一定的技术发展和影响力。</li>
<li>P7要求人员对一个小的产品或团队有方向性的指导。</li>
<li>P8 要求在一个大部门或公司级的产品上有方向性的指导。</li>
<li>P9要求除了考虑自身产品外，还要求在公司的角度考虑自身的产品对公司的发展有什么帮助。</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:34</p>
<p class="validation"></p>
</div>
</body>
</html>
